In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
s = Series(np.random.randint(0,150,size=20),index=np.arange(10,30),dtype=np.int16,name='Python')
s

10     68
11     70
12     73
13    105
14      9
15     46
16     12
17     99
18     21
19     57
20     99
21     65
22    103
23     67
24     31
25     80
26     77
27     68
28     51
29    138
Name: Python, dtype: int16

In [3]:
# s2 = Series(np.random.randint(10,20,size=10),index=np.arange(10,30,2),dtype=np.int16,name='Math')
# s2

In [4]:
# s+s2

In [5]:
#索引操作
s[10]

68

In [6]:
s[10:20]

20     99
21     65
22    103
23     67
24     31
25     80
26     77
27     68
28     51
29    138
Name: Python, dtype: int16

In [7]:
s[0:11]
#切片操作的索引是自然索引（从0开始）

10     68
11     70
12     73
13    105
14      9
15     46
16     12
17     99
18     21
19     57
20     99
Name: Python, dtype: int16

In [8]:
s[[10,20]]

10    68
20    99
Name: Python, dtype: int16

In [9]:
t = s[[10,20]]
print(type(t))

<class 'pandas.core.series.Series'>

In [ ]:
#s[]和numpy中的ndarry属性类似

In [10]:
s.loc[10]

68

In [11]:
s.loc[10:20]

10     68
11     70
12     73
13    105
14      9
15     46
16     12
17     99
18     21
19     57
20     99
Name: Python, dtype: int16

In [12]:
s.loc[::-2]

29    138
27     68
25     80
23     67
21     65
19     57
17     99
15     46
13    105
11     70
Name: Python, dtype: int16

In [13]:
#iloc 索引从0开始，数字化自然索引
s.iloc[0]

68

In [15]:
s.iloc[[10,19]]

20     99
29    138
Name: Python, dtype: int16

In [27]:
s.iloc[:10:-2]

29    138
27     68
25     80
23     67
21     65
Name: Python, dtype: int16

In [28]:
s.index

Int64Index([10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
            27, 28, 29],
           dtype='int64')

In [29]:
s.values

array([ 68,  70,  73, 105,   9,  46,  12,  99,  21,  57,  99,  65, 103,
        67,  31,  80,  77,  68,  51, 138], dtype=int16)

In [37]:
s.iloc[10:14:-2]#?????

Series([], Name: Python, dtype: int16)

In [38]:
s[s>99] #支持bool索引查询

13    105
22    103
29    138
Name: Python, dtype: int16

In [40]:
#DataFrame是二维，索引大同小异
df = DataFrame(data=np.random.randint(1,150,size=(10,3)),index=range(100,110),columns=['Python','En','Math'])
df

     Python   En  Math
100      44  104   121
101     118   41    31
102      46  126    18
103     112  136   120
104      81  139   111
105      72   45    65
106      80   32   116
107     139   80     2
108      78    2   148
109      73   75   111

In [45]:
df[df[['En','Math']]>100]
#DataFrame 只能获取列属性，属性比行样本重要

     Python     En   Math
100     NaN  104.0  121.0
101     NaN    NaN    NaN
102     NaN  126.0    NaN
103     NaN  136.0  120.0
104     NaN  139.0  111.0
105     NaN    NaN    NaN
106     NaN    NaN  116.0
107     NaN    NaN    NaN
108     NaN    NaN  148.0
109     NaN    NaN  111.0

In [50]:
df.loc[101]

Python    118
En         41
Math       31
Name: 101, dtype: int32

In [52]:
df.loc[[101,105]]

     Python  En  Math
101     118  41    31
105      72  45    65

In [54]:
df.loc[101:105]

     Python   En  Math
101     118   41    31
102      46  126    18
103     112  136   120
104      81  139   111
105      72   45    65

In [56]:
df.loc[::-1]

     Python   En  Math
109      73   75   111
108      78    2   148
107     139   80     2
106      80   32   116
105      72   45    65
104      81  139   111
103     112  136   120
102      46  126    18
101     118   41    31
100      44  104   121

In [58]:
df.loc[101:105:-1]#?????

Empty DataFrame
Columns: [Python, En, Math]
Index: []

In [59]:
df.iloc[0:5]

     Python   En  Math
100      44  104   121
101     118   41    31
102      46  126    18
103     112  136   120
104      81  139   111

In [74]:
df.iloc[-1:-9:-1,:1]
#对二维数组进行切片

     Python
109      73
108      78
107     139
106      80
105      72
104      81
103     112
102      46

In [76]:
df.iloc[-1:-9:-1,[0,2]]

     Python  Math
109      73   111
108      78   148
107     139     2
106      80   116
105      72    65
104      81   111
103     112   120
102      46    18